# Preparing the titanic for safe sailing

It's clear that the Titanic didn't have a good ending. Nevertheless, we now have a great dataset to practice and if we were going to make use of similar data, we would need to make sure that there is no way our customers, clients, or other people's personal information can be traced or exposed.

In this exercise we will practice some basic Supression andn Generalization techniques using Pandas and Scipy.

A copy of the Titanic dataset has already been loaded as a Pandas dataframe called `df`. Feel free to use the interactive console to explore more of it: checking the informantion and the data types with `df.info()`.



1. Drop the unique and NaN values from the dataset.
2. Anonymize the `Sex`cloumn by replacing to be encoded numeric labels.
3. Knowing that for the column "age" the best distribution fit is the "fisk", use it to obtain the necessary parameters and apply it to later generate sample data close to the original ones.
4. For even more privacy and avoiding leak some infomation about the dataset, replace the column names with numbers.

In [14]:
######## Pre code
import pandas as pd
import numpy as np
import scipy.stats
import statsmodels as sm
from math import floor
import matplotlib.pyplot as plt
from sklearn_pandas import DataFrameMapper
from sklearn.preprocessing import LabelEncoder
import warnings
warnings.filterwarnings("ignore")
# Multiple outputs per cell
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

# Import label encoder 
from sklearn import preprocessing 
label_encoder = preprocessing.LabelEncoder() 

df = pd.read_csv("titanic_train.csv")
df.shape
df

(891, 12)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [15]:
# Drop unique data and almost unique data for every row as well as NaN
df.drop(columns=["PassengerId", "Ticket", "Cabin", "Name", "Fare"], inplace=True) 
df.dropna(inplace=True)

# Encode labels in column 'Sex' so it's 0 or 1.
df['Sex']= label_encoder.fit_transform(df['Sex']) 

# Apply the best probabilistic distribution fit for Age:fisk and round it.
params = scipy.stats.fisk.fit(df['Age'])
df['Age'] = scipy.stats.fisk.rvs(size=len(df.index), *params).round()

# Replace the column names with numbers and see the new generated dataset
df.columns = list(range(df.shape[1]))
df.head()

   0  1  2     3  4  5  6
0  0  3  1  19.0  1  0  S
1  1  1  0  15.0  1  0  C
2  1  3  0  31.0  0  0  S
3  1  1  0  18.0  1  0  S
4  0  3  1  40.0  0  0  S

22